n = 0
while n < 100:
    n += 1
    if n % 2 == 0:
        print(n)

'''
Выведите в консоль все четные числа из промежутка от 1 до 100.
'''