n = 0
while n < 100:
    n += 1
    print(n)

'''
Выведите в консоль все целые числа от 1 до 100.
'''