n = 0
while n < 100:
    n += 1
    if n % 3 == 0:
        print(n)

'''
Выведите в консоль все числа кратные трем в промежутке от 1 до 100.
'''