n = -101
while n < 0:
    n += 1
    print(n)

'''
Выведите в консоль все целые числа от -100 до 0.
'''