str_ = 'abcdeabc'
list_ = set(str_)
list_s = sorted(list_)
print(list_s)

# Получили отсортированный список, а не сет. Как сделать отсортированный сет я хз
'''
Дана некоторая строка:
'abcdeabc'

Получите сет ее символов:
{'a', 'b', 'c', 'd', 'e'}
'''