num_1 = int(input("Укажите первое число >> "))
num_2 = int(input("Укажите второе число >> "))
print(f"Остаток от деления первого числа на второе >> {num_1 % num_2}")

'''
Даны два целых числа. Найдите остаток от деления первого числа на второе.
'''