n = 0
res = 0
while n < 100:
    n += 1
    if n % 2 != 0:
        res += n
print(res)

'''
Найдите сумму всех целых нечетных чисел в промежутке от 1 до 100.
'''