n = 0
res = 0
while n < 100:
    n += 1
    res += n
print(res)
'''
Найдите сумму всех целых чисел от 1 до 100.
'''