str_ = input("Введите строку >> ")
if len(str_) > 1:
    print(f"Предпоследний символ строки >> {str_[-2]}")

'''
Дана строка. Если в этой строке более одного символа,
выведите в консоль предпоследний символ этой строки.
'''