str_ = 'abcde'
print(list(str_))

'''
Дана некоторая строка:
'abcde'

Получите список ее символов:
['a', 'b', 'c', 'd', 'e']
'''