str_ = 'abcde'
print(list(str_))

'''
Дана строка:
'abcde'

Получите список букв этой строки.
'''