num = 12345
print(int(str(num)[::-1]))

'''
Дано некоторое число:
12345

Переверните его:
54321
'''