num = 12345
list_ = []
for i in list(str(num)):
    list_.append(int(i))

print(list_)

'''
Дано некоторое число:
12345

Получите список цифр этого числа.
'''