res = 0
dict_ = {
	'a': 1,
	'b': 2,
	'c': 3,
	'd': 4,
 }
for i in dict_.values():
    I = i ** 2
    res += I

print(res)

'''
Дан словарь:
{
	'a': 1,
	'b': 2,
	'c': 3, 
	'd': 4,
}

Найдите сумму квадратов элементов этого словаря.
'''