num = 12345
list_ = []
for i in list(str(num)):
    list_.append(int(i))

print(sum(list_))

'''
Дано некоторое число:
12345

Найдите сумму цифр этого числа.
'''