num = int(input("Укажите число >> "))
if num % 2 == 0:
    print("Число чётное")
else:
    print("Число нечётное")

# 0 считает за чётное
'''
Дано число. Проверьте, четное оно или нет.
'''