str_ = input("Введите строку >> ")
print(f"Длина строки >> {len(str_)}")

'''
Дана строка. Выведите в консоль длину этой строки.
'''