def plus_minus():
    i = int(input("Укажите число >> "))
    if i < 0:
        print("Число отрицательное")
    else:
        print("Число неотрицательное")

plus_minus() # Работает только с int
'''
Дано число. Проверьте, отрицательное оно или нет. 
Выведите об этом информацию в консоль.
'''
