word_1 = input("Укажите первое слово >> ")
word_2 = input("Укажите второе слово >> ")

if word_1[0] == word_2[0]:
    print("Первые буквы этих слов совпадают")
else:
    print("Первые буквы этих слов не совпадают")

'''
Даны два слова. Проверьте, что первые буквы этих слов совпадают.
'''