str_ = input("Введите строку >> ")
print(f"Последний символ строки >> {str_[-1]}")

'''
Дана строка. Выведите в консоль последний символ строки.
'''