num_1 = int(input("Введите первое число >> "))
num_2 = int(input("Введите второе число >> "))
if str(num_1)[0] == str(num_2)[0]:
    print("Первые цифры этих чисел совпадают")
else:
    print("Первые цифры этих чисел не совпадают")
'''
Даны два числа. Проверьте, что первые цифры этих чисел совпадают.
'''