list_ = [1, 2, 3, 4, 5, 6]
list_new = list_[0:3]
print(list_new)

'''
Дан список:
[1, 2, 3, 4, 5, 6]

Получите из него следующий срез:
[1, 2, 3]
'''