num = int(input("Введите число >> "))
print(f"Последняя цифра числа >> {str(num)[-1]}")

'''
Дано число. Выведите в консоль последнюю цифру этого числа.
'''