num = int(input("Введите число >> "))
print(f"Первая цифра числа >> {str(num)[0]}")

'''
Дано число. Выведите в консоль первую цифру этого числа.
'''