num = int(input("Введите число >> "))
num_first = int(str(num)[0])
num_last = int(str(num)[-1])
print(f"Сумму первой и последней цифры этого числа >> {num_first + num_last}")

'''
Дано число. Выведите в консоль сумму первой и последней цифры этого числа.
'''