num = int(input("Введите число >> "))
print(f"Количество цифр в этом числе >> {len(str(num))}")

'''
Дано число. Выведите количество цифр в этом числе.
'''