str_ = 'abcde'
for i in range(len(str_)):
    print(str_[-i - 1])

'''
Дана некоторая строка: 'abcde'
Переберите и выведите в консоль по очереди все символы с конца строки.
'''