list_ = [1, 2, 3, 4, 5]
res = 0
for i in list_:
    res += i ** 2
print(res)

'''
Дан список с числами:
[1, 2, 3, 4, 5]

Найдите сумму квадратов элементов этого списка.
'''