list_ = [-1, 2, -3, 4, 5, 11]
res = 0
for i in list_:
    if 0 < i < 10:
        res += i
print(res)

'''
Дан список с числами:
[-1, 2, -3, 4, 5, 11]

Найдите сумму тех элементов этого списка, которые больше нуля и меньше десяти.
'''