list_ = [1, 2, 3, 4, 5]
res = 0
for i in list_:
    res += i ** 0.5 # Можно было импортировать библиотеку math
print(res)

'''
Дан список с числами:
[1, 2, 3, 4, 5]

Найдите сумму квадратных корней элементов этого списка.
'''