list_ = [1, 2, -3, 4, -5]
res = 0
for i in list_:
    if i > 0:
        res += i
print(res)

'''
Дан список с числами:
[1, 2, -3, 4, -5]

Найдите сумму положительных элементов этого списка.
'''